In [2]:
import os
os.getcwd()

'c:\\Users\\Dell\\Desktop\\Tutorials\\Vinutha-Vijayakumar\\Python'

In [6]:
os.chdir('c:\\Users\\Dell\\Desktop\\Tutorials\\Vinutha-Vijayakumar')
os.getcwd()

'c:\\Users\\Dell\\Desktop\\Tutorials\\Vinutha-Vijayakumar'

In [12]:
os.listdir('c:\\Users\\Dell\\Desktop\\Tutorials\\Vinutha-Vijayakumar')

['input', 'Python']

In [18]:
os.listdir('c:\\Users\\Dell\\Desktop\\Tutorials\\Vinutha-Vijayakumar\\input')

['gender_submission.csv', 'test.csv', 'train.csv', 'train1.csv']

In [19]:
import pandas as pd
titanic_train = pd.read_csv('c:\\Users\\Dell\\Desktop\\Tutorials\\Vinutha-Vijayakumar\\input\\train.csv')

In [20]:
titanic_train.head(6)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q

In [30]:
import pandas as pd
!pip install openpyxl -q
import openpyxl as op


draft = pd.read_excel('c:\\Users\\Dell\\Desktop\\Tutorials\\Vinutha-Vijayakumar\\input\\FMV.xlsx' , sheet_name= 'Market Quotation_Equity')

draft.head(6)

WARNING: You are using pip version 21.2.4; however, version 23.1.2 is available.
You should consider upgrading via the 'C:\Users\Dell\AppData\Local\Programs\Python\Python310\python.exe -m pip install --upgrade pip' command.

,MARKET QUOTATION OF EQUITY SHARE,Unnamed: 1,Unnamed: 2,Unnamed: 3,
0,Note: The highest price of equity share quoted...,NaN,NaN,NaN,NaN
1,Name of scrip,Rs.,Date of quotation,Exchange,NaN
2,20 MICRONS,53.1,2018-01-31 00:00:00,NSE,NaN
3,21st CEN MGM,40.6,2018-01-31 00:00:00,BSE,NaN
4,3i INFOTECH,6.5,2018-01-31 00:00:00,NSE,NaN
5,3MINDIA,18875,2018-01-31 00:00:00,NSE,NaN

In [34]:
import os
draft.to_csv("draft_saved.csv")
os.listdir('c:\\Users\\Dell\\Desktop\\Tutorials\\Vinutha-Vijayakumar')

['draft_saved.csv', 'input', 'Python']